lihuashe/seneasy-work/RTL8752CJF-4416-5687/BEE2-SDK-RCU/src/ble/profile/server/dfu_service.c
    if (g_ota_tmp_buf_used_size == buffer_check_size ||
        g_dfu_para.cur_offset + g_ota_tmp_buf_used_size == g_dfu_para.image_total_length
       )
    {
        if (dfu_checkbufcrc(p_ota_temp_buffer_head, g_ota_tmp_buf_used_size, buffer_crc))     //crc error

        {
            DFU_PRINT_ERROR1("<==BufferCheckProc: Buf CRC Error! cur_offset=%d",
                             g_dfu_para.cur_offset);
            g_ota_tmp_buf_used_size = 0;
            notif_data[2] = DFU_ARV_FAIL_CRC_ERROR;
            LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
            server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                             notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
            return;
        }

        else //crc ok
        {
            if (OTP->ota_with_encryption_data)
            {
                //aes
                do
                {
                    if ((g_ota_tmp_buf_used_size - offset) >= 16)
                    {
#if defined ( __ICCARM__   )
#pragma diag_suppress=Pa039
#endif
                        hw_aes_init(OTP->aes_key, NULL, AES_MODE_ECB, OTP->ota_with_encryption_use_aes256);
#if defined ( __ICCARM__   )
#pragma diag_warning=Pa039
#endif
                        hw_aes_decrypt_16byte(p_ota_temp_buffer_head + offset, p_ota_temp_buffer_head + offset);
                        offset += 16;
                    }
                    else
                    {
                        break;
                    }
                }
                while (1);
            }
            unlock_flash_all();

#if (SUPPORT_TEMP_COMBINED_OTA == 1)
            result = sil_dfu_update(g_dfu_para.ctrl_header.image_id,
                                    g_dfu_para.cur_offset + temp_image_info[temp_image_num].image_offset,
                                    g_ota_tmp_buf_used_size, (uint32_t *)p_ota_temp_buffer_head, false);
#else
            result = sil_dfu_update(g_dfu_para.ctrl_header.image_id, g_dfu_para.cur_offset,
                                    g_ota_tmp_buf_used_size,
                                    (uint32_t *)p_ota_temp_buffer_head);
#endif
            if (result == 0)
            {
                g_dfu_para.cur_offset += g_ota_tmp_buf_used_size;
                if ((g_dfu_para.cur_offset - g_sil_dfu_resend_offset) >= FMC_SEC_SECTION_LEN)
                {
                    g_sil_dfu_resend_offset += FMC_SEC_SECTION_LEN;
                }

                g_ota_tmp_buf_used_size = 0;
                notif_data[2] = DFU_ARV_SUCCESS; //valid
                LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
                server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
                lock_flash();
                return;
            }
            else
            {
                DFU_PRINT_ERROR1("<==BufferCheckProc: sil_dfu_update fail result=%d", result);

                result = sil_dfu_flash_erase_with_retry(g_dfu_para.ctrl_header.image_id,
                                                        g_sil_dfu_resend_offset, FMC_SEC_SECTION_LEN);
                if (result)
                {
                    //erase fail
                    g_ota_tmp_buf_used_size = 0;
                    g_dfu_para.cur_offset =  g_sil_dfu_resend_offset;
                    DFU_PRINT_ERROR1("<==BufferCheckProc:erase flash fail 3 times! cur_offset=%d",
                                     g_dfu_para.cur_offset);

                    notif_data[2] = DFU_ARV_FAIL_ERASE_ERROR;
                    LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
                    server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                     notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
                    lock_flash();
                    return;
                }

                //need erase two sector
                if ((g_dfu_para.cur_offset - g_sil_dfu_resend_offset) > FMC_SEC_SECTION_LEN)
                {
                    DFU_PRINT_INFO0("<==BufferCheckProc: need erase two sectors");
                    result = sil_dfu_flash_erase_with_retry(g_dfu_para.ctrl_header.image_id,
                                                            g_sil_dfu_resend_offset + FMC_SEC_SECTION_LEN, FMC_SEC_SECTION_LEN);
                    if (result)
                    {
                        g_ota_tmp_buf_used_size = 0;
                        g_dfu_para.cur_offset =  g_sil_dfu_resend_offset;
                        DFU_PRINT_ERROR1("<==BufferCheckProc:erase flash fail 3 times! cur_offset=%d",
                                         g_dfu_para.cur_offset);

                        notif_data[2] = DFU_ARV_FAIL_ERASE_ERROR;
                        LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
                        server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                         notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
                        lock_flash();
                        return;
                    }

                }
                //erase ok
                g_ota_tmp_buf_used_size = 0;
                g_dfu_para.cur_offset =  g_sil_dfu_resend_offset;
                DFU_PRINT_INFO1("<==BufferCheckProc:erase ok! cur_offset=%d", g_dfu_para.cur_offset);
                notif_data[2] = DFU_ARV_FAIL_PROG_ERROR;
                LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
                server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
                lock_flash();
                return;
            }
        }
    }
    else
    {
        DFU_PRINT_ERROR4("<==BufferCheckProc: Error buffer_check_size==%d,buf_used_size=%d,cur_offset=%d,image_total_length=%d",
                         buffer_check_size, g_ota_tmp_buf_used_size,
                         g_dfu_para.cur_offset, g_dfu_para.image_total_length);
        //flush buffer.
        g_ota_tmp_buf_used_size = 0;
        notif_data[2] = DFU_ARV_FAIL_LENGTH_ERROR;
        LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
        server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
        return;
    }
}

void dfu_notify_conn_para_update_req(uint8_t conn_id, T_DFU_ARV_ERROR_CODE error_code)
{
    if (g_dfu_para.dfu_conn_para_upd_in_progress == true)
    {
        g_dfu_para.dfu_conn_para_upd_in_progress = false;
        uint8_t notif_data[3] = {0};
        notif_data[0] = DFU_OPCODE_NOTIFICATION;
        notif_data[1] = DFU_OPCODE_CONN_PARA_TO_UPDATE_REQ;
        notif_data[2] = error_code;

        DFU_PRINT_INFO1("<==dfu_notify_conn_para_update_req error_code=0x%x", error_code);
        /* Connection Param Update rejected, we should notify the fail result to remote device. */
        server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, DFU_NOTIFY_LENGTH_CONN_PARA_UPDATE_REQ, GATT_PDU_TYPE_NOTIFICATION);
    }
}

void dfu_service_handle_valid_fw(uint8_t conn_id)
{
    uint8_t notif_data[DFU_NOTIFY_LENGTH_VALID_FW] = {0};
    bool check_result = false;

#if (SUPPORT_TEMP_COMBINED_OTA == 1)
    bool is_enable_bank_switch = is_ota_support_bank_switch();

