lihuashe/seneasy-work/RTL8752CJF-4416-5687/BEE2-SDK-RCU/src/ble/profile/server/dfu_service.c
    if (is_enable_bank_switch)
    {
        check_result = silent_dfu_check_checksum(g_dfu_para.ctrl_header.image_id, 0);
    }
    else
    {
        check_result = silent_dfu_check_checksum(temp_image_info[temp_image_num].image_id,
                                                 temp_image_info[temp_image_num].image_offset);
    }
#else
    check_result = silent_dfu_check_checksum(g_dfu_para.ctrl_header.image_id);
#endif
    DFU_PRINT_INFO1("DFU_OPCODE_VALID_FW: check_result=%d (1: Success, 0: Fail)", check_result);

    if (check_result)
    {
#if (SUPPORT_TEMP_COMBINED_OTA == 1)
        if (!is_enable_bank_switch)
        {
            temp_image_num ++;
            DFU_PRINT_INFO1("DFU_OPCODE_VALID_FW: temp_image_num=%d ", temp_image_num);
        }
#endif
        notif_data[2] = DFU_ARV_SUCCESS;
    }
    else
    {
        notif_data[2] = DFU_ARV_FAIL_CRC_ERROR;
    }
    notif_data[0] = DFU_OPCODE_NOTIFICATION;
    notif_data[1] = DFU_OPCODE_VALID_FW;
    server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                     notif_data, DFU_NOTIFY_LENGTH_VALID_FW, GATT_PDU_TYPE_NOTIFICATION);
}

void dfu_service_handle_active_image(void)
{
    T_IMG_CTRL_HEADER_FORMAT *p_header = NULL;
    T_IMG_ID image_id = (T_IMG_ID)g_dfu_para.ctrl_header.image_id;

    if (IMAGE_USER_DATA == image_id || IMAGE_USER_DATA2 == image_id)
    {
        if (IMAGE_USER_DATA == image_id)
        {
            p_header = (T_IMG_CTRL_HEADER_FORMAT *)(flash_get_bank_addr(FLASH_BKP_DATA1) |
                                                    FLASH_OFFSET_TO_NO_CACHE);
        }
        else
        {
            p_header = (T_IMG_CTRL_HEADER_FORMAT *)(flash_get_bank_addr(FLASH_BKP_DATA2) |
                                                    FLASH_OFFSET_TO_NO_CACHE);
        }

        dfu_set_image_ready(p_header);
    }
    else // not user data image
    {
        if (!is_ota_support_bank_switch())
        {
            uint32_t base_addr = 0;

#if (SUPPORT_OTA_APP_DATA_EXTENSION == 1)
            base_addr = flash_ioctl(flash_ioctl_get_temp_bank_addr_by_image_id_ext, (T_IMG_ID)image_id, 0);
#else
            /* check OTA temp to see if received image is OK.*/
            base_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id);
#endif

#if (SUPPORT_TEMP_COMBINED_OTA == 1)
            for (uint8_t i = 0; i < temp_image_num; i++)
            {
                p_header = (T_IMG_CTRL_HEADER_FORMAT *)(base_addr + temp_image_info[i].image_offset);
                dfu_set_image_ready(p_header);
            }
#else
            p_header = (T_IMG_CTRL_HEADER_FORMAT *)base_addr;
            dfu_set_image_ready(p_header);
#endif
        }
        else
        {
            //support bank switch
#if (SUPPORT_OTA_APP_DATA_EXTENSION == 1)
            for (uint16_t img_id = IMAGE_MAX - 1; img_id >= OTA; img_id--)
#else
            for (uint16_t img_id = AppData2; img_id >= OTA; img_id--)
#endif
            {
                if (GET_VALID_BITMAP(img_id))
                {
#if (SUPPORT_OTA_APP_DATA_EXTENSION == 1)
                    p_header = (T_IMG_CTRL_HEADER_FORMAT *)flash_ioctl(flash_ioctl_get_temp_bank_addr_by_image_id_ext,
                                                                       (T_IMG_ID)img_id, 0);
#else
                    /* check OTA temp to see if received image is OK.*/
                    p_header = (T_IMG_CTRL_HEADER_FORMAT *)get_temp_ota_bank_addr_by_img_id((T_IMG_ID)img_id);
#endif
                    dfu_set_image_ready(p_header);
                }
            }
        }
    }

}

/**
 * @brief silence_dfu_service_handle_control_point_req
 *
 * @param length     control point cmd length.
 * @param p_value    control point cmd address..
 * @return None
*/
void  silence_dfu_service_handle_control_point_req(uint8_t conn_id, uint16_t length,
                                                   uint8_t *p_value)
{
    T_DFU_CTRL_POINT dfu_control_point;
    uint8_t notif_data[DFU_NOTIFY_LENGTH_MAX] = {0};

    dfu_control_point.opcode = * p_value;
    uint8_t *p = p_value + 1;

    DFU_PRINT_TRACE2("====>dfu_service_handle_control_point_req: opcode=0x%x, length=%d",
                     dfu_control_point.opcode, length);

    if (dfu_control_point.opcode >= DFU_OPCODE_MAX || dfu_control_point.opcode <= DFU_OPCODE_MIN)
    {
        notif_data[0] = DFU_OPCODE_NOTIFICATION;
        notif_data[1] = dfu_control_point.opcode;
        notif_data[2] = 0xff;
        server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, DFU_NOTIFY_LENGTH_ARV, GATT_PDU_TYPE_NOTIFICATION);
        return;
    }

    switch (dfu_control_point.opcode)
    {
    case DFU_OPCODE_START_DFU: //0x01
        if (length == DFU_LENGTH_START_DFU)/*4 bytes is pending for encrypt*/
        {
            if (OTP->ota_with_encryption_data)
            {
                DFU_PRINT_TRACE1("DFU_OPCODE_START_DFU: Encryped Data=%b", TRACE_BINARY(16, p));
#if defined ( __ICCARM__   )
#pragma diag_suppress=Pa039
#endif
                hw_aes_init(OTP->aes_key, NULL, AES_MODE_ECB, OTP->ota_with_encryption_use_aes256);
#if defined ( __ICCARM__   )
#pragma diag_warning=Pa039
#endif
                hw_aes_decrypt_16byte(p, p);
                DFU_PRINT_TRACE1("DFU_OPCODE_START_DFU: Decryped Data=%b", TRACE_BINARY(16, p));
            }

            dfu_control_point.start_dfu.ic_type = (*p);
            p += 1;
            dfu_control_point.start_dfu.secure_version = (*p);
            p += 1;
            LE_ARRAY_TO_UINT16(dfu_control_point.start_dfu.ctrl_flag.value, p);
            p += 2;
            LE_ARRAY_TO_UINT16(dfu_control_point.start_dfu.image_id, p);
            p += 2;
            LE_ARRAY_TO_UINT16(dfu_control_point.start_dfu.crc16, p);
            p += 2;
            LE_ARRAY_TO_UINT32(dfu_control_point.start_dfu.payload_len, p);

            DFU_PRINT_TRACE6("DFU_OPCODE_START_DFU: ic_type=0x%x, secure_version=0x%x, ctrl_flag.value=0x%x, image_id=0x%x,crc16=0x%x, payload_len=%d",
                             dfu_control_point.start_dfu.ic_type,
                             dfu_control_point.start_dfu.secure_version,
                             dfu_control_point.start_dfu.ctrl_flag.value,
                             dfu_control_point.start_dfu.image_id,
                             dfu_control_point.start_dfu.crc16,
                             dfu_control_point.start_dfu.payload_len
                            );
            g_dfu_para.ctrl_header.ic_type = dfu_control_point.start_dfu.ic_type;
            g_dfu_para.ctrl_header.ctrl_flag.value = dfu_control_point.start_dfu.ctrl_flag.value;
            g_dfu_para.ctrl_header.image_id = dfu_control_point.start_dfu.image_id;
            g_dfu_para.ctrl_header.crc16 = dfu_control_point.start_dfu.crc16;
            g_dfu_para.ctrl_header.payload_len = dfu_control_point.start_dfu.payload_len;

