lihuashe/seneasy-work/RTL8752CJF-4416-5687/BEE2-SDK-RCU/src/ble/profile/server/dfu_service.c
            g_dfu_para.image_total_length = g_dfu_para.ctrl_header.payload_len + IMG_HEADER_SIZE;

            /*check if start dfu fileds are vaild*/
#ifdef SDK_8772
            if (g_dfu_para.ctrl_header.ic_type == 0x09)
#else
            if (g_dfu_para.ctrl_header.ic_type == 0x05)
#endif
            {
                if (((g_dfu_para.ctrl_header.image_id >= OTA) && (g_dfu_para.ctrl_header.image_id < IMAGE_MAX))
                    || (IMAGE_USER_DATA == g_dfu_para.ctrl_header.image_id)
                    || (IMAGE_USER_DATA2 == g_dfu_para.ctrl_header.image_id))
                {
#if (SUPPORT_TEMP_COMBINED_OTA == 1)
                    /*disable bank switch, need record temp image info*/
                    if (!is_ota_support_bank_switch())
                    {
                        temp_image_info[temp_image_num].image_id = (T_IMG_ID)g_dfu_para.ctrl_header.image_id;
//                        temp_image_info[temp_image_num].image_size = UP_ALIGN(g_dfu_para.image_total_length, FMC_SEC_SECTION_LEN);
                        temp_image_info[temp_image_num].image_size = g_dfu_para.image_total_length;
                        if (temp_image_num == 0)
                        {
                            temp_image_info[temp_image_num].image_offset = 0;
                        }
                        else
                        {
                            temp_image_info[temp_image_num].image_offset = temp_image_info[temp_image_num - 1].image_offset +
                                                                           temp_image_info[temp_image_num - 1].image_size;
                        }
                    }
                    DFU_PRINT_INFO4("DFU_OPCODE_START_DFU: image_num=%d, image_id=0x%x, image_size=0x%x, image_offset=0x%x",
                                    temp_image_num, temp_image_info[temp_image_num].image_id,
                                    temp_image_info[temp_image_num].image_size, temp_image_info[temp_image_num].image_offset);
#endif


                    unlock_flash_all();
#if (SUPPORT_TEMP_COMBINED_OTA == 1)
                    uint32_t result = sil_dfu_update(g_dfu_para.ctrl_header.image_id,
                                                     0 + temp_image_info[temp_image_num].image_offset, DFU_HEADER_SIZE,
                                                     (uint32_t *)&g_dfu_para.ctrl_header, true);
#else
                    uint32_t result = sil_dfu_update(g_dfu_para.ctrl_header.image_id, 0, DFU_HEADER_SIZE,
                                                     (uint32_t *)&g_dfu_para.ctrl_header.ic_type);
#endif
                    lock_flash();
                    if (result == 0)
                    {
                        g_dfu_para.cur_offset += DFU_HEADER_SIZE;
                    }
                    else
                    {
                        DBG_DIRECT("DFU_OPCODE_START_DFU: sil_dfu_update error=%d", result);
                        silent_dfu_reset(g_dfu_para.ctrl_header.image_id);
                        dfu_fw_active_reset();
                    }

                    PROFILE_PRINT_INFO0("DFU_OPCODE_START_DFU: success");
                    notif_data[0] = DFU_OPCODE_NOTIFICATION;
                    notif_data[1] = DFU_OPCODE_START_DFU;
                    notif_data[2] = DFU_ARV_SUCCESS;

                    server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                     notif_data, DFU_NOTIFY_LENGTH_ARV, GATT_PDU_TYPE_NOTIFICATION);

                }
                else
                {
                    DFU_PRINT_ERROR1("DFU_OPCODE_START_DFU: signature=0x%x invalid", g_dfu_para.ctrl_header.image_id);
                    notif_data[0] = DFU_OPCODE_NOTIFICATION;
                    notif_data[1] = DFU_OPCODE_START_DFU;
                    notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
                    server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                     notif_data, DFU_NOTIFY_LENGTH_ARV, GATT_PDU_TYPE_NOTIFICATION);
                    return;
                }
            }
            else
            {
                DFU_PRINT_ERROR1("DFU_OPCODE_START_DFU: ic_type=0x%x invalid", g_dfu_para.ctrl_header.ic_type);
                notif_data[0] = DFU_OPCODE_NOTIFICATION;
                notif_data[1] = DFU_OPCODE_START_DFU;
                notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
                server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, DFU_NOTIFY_LENGTH_ARV, GATT_PDU_TYPE_NOTIFICATION);
                return;
            }
        }
        break;

    case DFU_OPCODE_RECEIVE_FW_IMAGE_INFO://0x02
        if (length == DFU_LENGTH_RECEIVE_FW_IMAGE_INFO)
        {
            LE_ARRAY_TO_UINT16(g_dfu_para.ctrl_header.image_id, p);
            p += 2;
            LE_ARRAY_TO_UINT32(g_dfu_para.cur_offset, p);
            if ((g_dfu_para.cur_offset == 0) || (g_dfu_para.cur_offset == DFU_HEADER_SIZE))
            {
                g_ota_tmp_buf_used_size = 0;
                g_sil_dfu_resend_offset = 0;
            }
            DFU_PRINT_TRACE2("DFU_OPCODE_RECEIVE_FW_IMAGE_INFO: signature=0x%x, cur_offset=%d",
                             g_dfu_para.ctrl_header.image_id, g_dfu_para.cur_offset);
        }
        else
        {
            DFU_PRINT_ERROR1("DFU_OPCODE_RECEIVE_FW_IMAGE_INFO: invalid length=%d", length);
        }
        break;

    case DFU_OPCODE_VALID_FW://0x03

        if (length == DFU_LENGTH_VALID_FW)
        {
            LE_ARRAY_TO_UINT16(g_dfu_para.ctrl_header.image_id, p);
            DFU_PRINT_TRACE1("DFU_OPCODE_VALID_FW: signature=0x%x", g_dfu_para.ctrl_header.image_id);

            /*if ota large img, need modify wdg timeout period*/
            if (OTP->wdgEnableInRom && g_dfu_para.image_total_length > 0x100000)
            {
                /*1M and less---4s, 2M and less---8s,..., 8M and less---32s*/
                uint32_t img_align_len = ((g_dfu_para.image_total_length + (0x100000 - 1)) & (~(0x100000 - 1)));
                uint8_t wdg_period_4s = (img_align_len / 0x100000);
                uint16_t div_factor = (32 * wdg_period_4s - 1);
                DFU_PRINT_TRACE2("DFU_OPCODE_VALID_FW: Change WDG Period to %ds, div_factor=%d", wdg_period_4s << 2,
                                 div_factor);
                WDG_Config(div_factor, 15, RESET_ALL); //31 - 4s, 63 - 8s
            }
        }
        else
        {
            DFU_PRINT_ERROR1("DFU_OPCODE_VALID_FW: invalid length=%d", length);
        }
        break;

