lihuashe/seneasy-work/RTL8752CJF-4416-5687/BEE2-SDK-RCU/src/ble/profile/server/dfu_service.c
            notif_data[0] = DFU_OPCODE_NOTIFICATION;
            notif_data[1] = DFU_OPCODE_COPY_IMG;

            if (sil_dfu_copy_img(g_dfu_para.ctrl_header.image_id, dlAddress, dlSize))
            {
                notif_data[2] = DFU_ARV_SUCCESS;
            }
            else
            {
                notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
            }
            server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                             notif_data, DFU_NOTIFY_LENGTH_ARV, GATT_PDU_TYPE_NOTIFICATION);
        }
        break;
#endif  //#if APP_DATA_COPY_ENABLE

    default:
        {
            DFU_PRINT_TRACE1("dfu_service_handle_control_point_req: Unknown Opcode=0x%x",
                             dfu_control_point.opcode
                            );
        }
        break;
    }

    /*if after dfu sevice done application still need do something, define this callback*/
    if (dfu_service_handle_control_point_req_cb)
    {
        dfu_service_handle_control_point_req_cb(conn_id, dfu_control_point.opcode);
    }

}


/**
 * @brief silence_dfu_service_handle_packet_req
 *
 * @param length     data reviewed length.
 * @param p_value    data receive point address.
 * @return None
*/
void silence_dfu_service_handle_packet_req(uint16_t length, uint8_t *p_value)
{
    DFU_PRINT_TRACE4("====>dfu_service_handle_packet_req: length=%d, cur_offset=%d, ota_temp_buf_used_size=%d, image_total_length=%d",
                     length, g_dfu_para.cur_offset,
                     g_ota_tmp_buf_used_size, g_dfu_para.image_total_length);

    if (buffer_check_en == true)
    {
        if (g_ota_tmp_buf_used_size + length > DFU_TEMP_BUFFER_SIZE)
        {
            DFU_PRINT_ERROR2("====>dfu_service_handle_packet_req: buffer overflow! ota_tmp_buf_used_size=%d, max_buffer_size=%d",
                             g_ota_tmp_buf_used_size + length, DFU_TEMP_BUFFER_SIZE);
            dfu_fw_active_reset();
        }
        memcpy(p_ota_temp_buffer_head + g_ota_tmp_buf_used_size, p_value, length);
        g_ota_tmp_buf_used_size += length;
    }
    else
    {
        /*when disable buffer check, client send 20bytes per packet*/
        uint32_t max_buffer_size = DFU_TEMP_BUFFER_SIZE - (DFU_TEMP_BUFFER_SIZE % 20);
        /*check memcpy buffer boundary*/
        if (g_ota_tmp_buf_used_size + length > max_buffer_size)
        {
            DFU_PRINT_ERROR2("====>dfu_service_handle_packet_req: buffer overflow! ota_tmp_buf_used_size=%d, max_buffer_size=%d",
                             g_ota_tmp_buf_used_size + length, max_buffer_size);
            dfu_fw_active_reset();
        }

        /*check total length*/
        if (g_dfu_para.cur_offset + g_ota_tmp_buf_used_size + length > g_dfu_para.image_total_length)
        {
            DFU_PRINT_ERROR1("====>dfu_service_handle_packet_req: received data total length beyond image_total_length(%d bytes)",
                             g_dfu_para.image_total_length);
            dfu_fw_active_reset();
        }

        /*start handle received data*/
        //1. deceypt data
        if (length >= 16)
        {
            if (OTP->ota_with_encryption_data)
            {
                uint16_t offset = 0;
                do
                {
                    if ((length - offset) >= 16)
                    {
#if defined ( __ICCARM__   )
#pragma diag_suppress=Pa039
#endif
                        hw_aes_init(OTP->aes_key, NULL, AES_MODE_ECB, OTP->ota_with_encryption_use_aes256);
#if defined ( __ICCARM__   )
#pragma diag_warning=Pa039
#endif
                        hw_aes_decrypt_16byte(p_value + offset, p_value + offset);
                        offset += 16;
                    }
                    else
                    {
                        break;
                    }
                }
                while (1);
            }
        }

        //2. copy received data to buffer
        memcpy(p_ota_temp_buffer_head + g_ota_tmp_buf_used_size, p_value, length);
        g_ota_tmp_buf_used_size += length;

        //3. write to flash
        if (g_ota_tmp_buf_used_size == max_buffer_size ||
            g_dfu_para.cur_offset + g_ota_tmp_buf_used_size == g_dfu_para.image_total_length)
        {
            unlock_flash_all();
#if (SUPPORT_TEMP_COMBINED_OTA == 1)
            uint32_t result = sil_dfu_update(g_dfu_para.ctrl_header.image_id,
                                             g_dfu_para.cur_offset + temp_image_info[temp_image_num].image_offset,
                                             g_ota_tmp_buf_used_size,
                                             (uint32_t *)p_ota_temp_buffer_head, false);
#else
            uint32_t result = sil_dfu_update(g_dfu_para.ctrl_header.image_id, g_dfu_para.cur_offset,
                                             g_ota_tmp_buf_used_size,
                                             (uint32_t *)p_ota_temp_buffer_head);
#endif
            lock_flash();
            if (result == 0)
            {
                g_dfu_para.cur_offset += g_ota_tmp_buf_used_size;
                g_ota_tmp_buf_used_size = 0;
            }
            else
            {
                /*write flash fail, restart ota procedure.*/
                DBG_DIRECT("dfu_service_handle_packet_req: sil_dfu_update error=%d", result);
                silent_dfu_reset(g_dfu_para.ctrl_header.image_id);
                //WDG reset system
                dfu_fw_active_reset();
            }

        }
    }

}

/**
 * @brief write characteristic data from service.
 *
 * @param ServiceID          ServiceID to be written.
 * @param iAttribIndex       Attribute index of characteristic.
 * @param wLength            length of value to be written.
 * @param pValue             value to be written.
 * @return Profile procedure result
*/
T_APP_RESULT dfu_attr_write_cb(uint8_t conn_id, uint8_t service_id, uint16_t attrib_index,
                               T_WRITE_TYPE write_type,
                               uint16_t length, uint8_t *p_value, P_FUN_WRITE_IND_POST_PROC *p_write_ind_post_proc)
{
    T_APP_RESULT w_cause = APP_RESULT_SUCCESS;

    if (attrib_index == INDEX_DFU_CONTROL_POINT_CHAR_VALUE)
    {
        silence_dfu_service_handle_control_point_req(conn_id, length, p_value);
    }
    else if (attrib_index == INDEX_DFU_PACKET_VALUE)
    {
        silence_dfu_service_handle_packet_req(length, p_value);
    }
    else
    {
        PROFILE_PRINT_INFO1("dfu_attr_write_cb fail: attrib_index=%d", attrib_index);

        return APP_RESULT_ATTR_NOT_FOUND;

